# CONSULTAS ANIDADAS EN SQL.

Las consultas anidadas son consultas que se utilizan dentro de otras consultas. Esto nos permite realizar operaciones más complejas y seleccionar datos de varias tablas a la vez.

Por ejemplo, imagine que tenemos una tabla de "ejercicios" y otra tabla de "alimentos". Si queremos encontrar el ejercicio que quema más calorías y el alimento que proporciona más proteínas, podemos utilizar consultas anidadas para realizar estas operaciones de manera independiente y luego combinarlas en una única consulta.

Para anidar consultas, debemos utilizar la palabra clave SELECT seguida de las columnas que queremos seleccionar y de la palabra clave FROM, seguida del nombre de la tabla. A continuación, debemos escribir la consulta anidada entre paréntesis y asignarle un alias. Por último, podemos utilizar la consulta anidada en la cláusula WHERE de la consulta principal para seleccionar los datos que cumplan con las condiciones especificadas en la consulta anidada.

Por ejemplo, si queremos encontrar el ejercicio que quema más calorías y el alimento que proporciona más proteínas, podemos utilizar las siguientes consultas anidadas:

```sql
SELECT (SELECT type FROM exercise_logs ORDER BY calories DESC LIMIT 1) AS most_caloric_exercise,
       (SELECT name FROM foods ORDER BY protein DESC LIMIT 1) AS most_protein_food;
```

Esta consulta nos devolverá el ejercicio que más calorías quema y el alimento que más proteínas proporciona. Las consultas anidadas nos permiten realizar operaciones más complejas y seleccionar datos de varias tablas a la vez, lo que nos permite obtener información más detallada y precisa de nuestros datos.

# 1. Clausula IN

La cláusula IN en SQL se utiliza para especificar una lista de valores a comparar con una columna en una tabla. Por ejemplo:

```sql
SELECT * FROM tabla WHERE columna IN (valor1, valor2, valor3);

```

Esto seleccionaría todas las filas de la tabla donde la columna es igual a cualquiera de los valores especificados en la lista (valor1, valor2, valor3). La cláusula IN se puede utilizar en cualquier lugar donde se espere una expresión de comparación.

También puedes utilizar la cláusula NOT IN para seleccionar todas las filas donde la columna no es igual a ninguno de los valores especificados en la lista. Por ejemplo:

```sql
SELECT * FROM tabla WHERE columna NOT IN (valor1, valor2, valor3);

```

Esto seleccionaría todas las filas de la tabla donde la columna es diferente a todos los valores especificados en la lista.

# Ejemplos.

Seleccionar todos los productos con un precio específico:

```sql
SELECT * FROM productos WHERE precio IN (9.99, 14.99, 19.99);
```

Seleccionar todos los clientes que viven en una de varias ciudades:

```sql
SELECT * FROM clientes WHERE ciudad IN ('Nueva York', 'Los Ángeles', 'Chicago');
```

Seleccionar todas las películas que son de uno de varios géneros:

```sql
SELECT * FROM peliculas WHERE genero IN ('comedia', 'acción', 'aventura');

```

Seleccionar todas las filas de una tabla que no tienen un valor NULL en una columna específica:

```sql
SELECT * FROM tabla WHERE columna NOT IN (NULL);
```

# 2. Combinar y consultar

Crearemos dos tablas, las combinaremos y extraremos datos de la combinación de las dos tablas.

In [1]:
#Iniciar SQLite
%load_ext sql
%sql sqlite://

In [2]:
%%sql
CREATE TABLE clientes (
  id INTEGER PRIMARY KEY,
  nombre TEXT,
  pais TEXT
);

INSERT INTO clientes (id, nombre, pais) VALUES
  (1, 'Juan', 'España'),
  (2, 'Maria', 'España'),
  (3, 'Pedro', 'México'),
  (4, 'Ana', 'Estados Unidos'),
  (5, 'Carlos', 'España');

CREATE TABLE pedidos (
  id INTEGER PRIMARY KEY,
  id_cliente INTEGER,
  monto REAL,
  FOREIGN KEY (id_cliente) REFERENCES clientes (id)
);

INSERT INTO pedidos (id, id_cliente, monto) VALUES
  (1, 1, 100),
  (2, 2, 50),
  (3, 3, 75),
  (4, 4, 200),
  (5, 1, 25),
  (6, 5, 125);

 * sqlite://
Done.
5 rows affected.
Done.
6 rows affected.

[]

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

# Actividad.
Crea una tabla para probar que las dos tablas anteriores se ven, para ello ten presente en la sentencia FROM, colocar las dos tablas separadas por comas.

In [4]:
%%sql
SELECT * FROM Clientes, Pedidos;

 * sqlite://
Done.

[(1, 'Juan', 'España', 1, 1, 100.0),
 (1, 'Juan', 'España', 2, 2, 50.0),
 (1, 'Juan', 'España', 3, 3, 75.0),
 (1, 'Juan', 'España', 4, 4, 200.0),
 (1, 'Juan', 'España', 5, 1, 25.0),
 (1, 'Juan', 'España', 6, 5, 125.0),
 (2, 'Maria', 'España', 1, 1, 100.0),
 (2, 'Maria', 'España', 2, 2, 50.0),
 (2, 'Maria', 'España', 3, 3, 75.0),
 (2, 'Maria', 'España', 4, 4, 200.0),
 (2, 'Maria', 'España', 5, 1, 25.0),
 (2, 'Maria', 'España', 6, 5, 125.0),
 (3, 'Pedro', 'México', 1, 1, 100.0),
 (3, 'Pedro', 'México', 2, 2, 50.0),
 (3, 'Pedro', 'México', 3, 3, 75.0),
 (3, 'Pedro', 'México', 4, 4, 200.0),
 (3, 'Pedro', 'México', 5, 1, 25.0),
 (3, 'Pedro', 'México', 6, 5, 125.0),
 (4, 'Ana', 'Estados Unidos', 1, 1, 100.0),
 (4, 'Ana', 'Estados Unidos', 2, 2, 50.0),
 (4, 'Ana', 'Estados Unidos', 3, 3, 75.0),
 (4, 'Ana', 'Estados Unidos', 4, 4, 200.0),
 (4, 'Ana', 'Estados Unidos', 5, 1, 25.0),
 (4, 'Ana', 'Estados Unidos', 6, 5, 125.0),
 (5, 'Carlos', 'España', 1, 1, 100.0),
 (5, 'Carlos', 'España', 2, 2, 50.0),
 (5, 'Carlos', 'España', 3, 3, 75.0),
 (5, 'Carlos', 'España', 4, 4, 200.0),
 (5, 'Carlos', 'España', 5, 1, 25.0),
 (5, 'Carlos', 'España', 6, 5, 125.0)]

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

Aquí tienes un ejemplo más sencillo de consultas anidadas:

Consideremos una tabla de "clientes" con los siguientes datos:

<table>
  <thead>
    <tr>
      <th>id</th>
      <th>nombre</th>
      <th>pais</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>1</td>
      <td>Juan</td>
      <td>España</td>
    </tr>
    <tr>
      <td>2</td>
      <td>Maria</td>
      <td>España</td>
    </tr>
    <tr>
      <td>3</td>
      <td>Pedro</td>
      <td>México</td>
    </tr>
    <tr>
      <td>4</td>
      <td>Ana</td>
      <td>Estados Unidos</td>
    </tr>
    <tr>
      <td>5</td>
      <td>Carlos</td>
      <td>España</td>
    </tr>
  </tbody>
</table>

Y otra tabla de "pedidos" con los siguientes datos:

<table>
  <thead>
    <tr>
      <th>id</th>
      <th>id_cliente</th>
      <th>monto</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>1</td>
      <td>1</td>
      <td>100</td>
    </tr>
    <tr>
      <td>2</td>
      <td>2</td>
      <td>50</td>
    </tr>
    <tr>
      <td>3</td>
      <td>3</td>
      <td>75</td>
    </tr>
    <tr>
      <td>4</td>
      <td>4</td>
      <td>200</td>
    </tr>
    <tr>
      <td>5</td>
      <td>1</td>
      <td>25</td>
    </tr>
    <tr>
      <td>6</td>
      <td>5</td>
      <td>125</td>
    </tr>
  </tbody>
</table>

Si queremos obtener el nombre de los clientes que hayan realizado al menos un pedido de más de 100 dólares, podemos utilizar la siguiente consulta anidada:

```sql
SELECT nombre FROM clientes WHERE id IN (SELECT id_cliente FROM pedidos WHERE monto > 100);
```

Esta consulta nos devolverá los nombres de los clientes que hayan realizado al menos un pedido de más de 100 dólares:

## nombre
Juan
Ana

Como puedes ver, las consultas anidadas nos permiten realizar operaciones más complejas y seleccionar datos de varias tablas a la vez. En este caso, hemos utilizado la consulta anidada en la cláusula WHERE para seleccionar los clientes que hayan realizado al menos un pedido de más de 100 dólares.

In [7]:
%%sql
SELECT nombre, pais FROM clientes WHERE id IN (SELECT id_cliente FROM pedidos WHERE monto > 100);

 * sqlite://
Done.

[('Ana', 'Estados Unidos'), ('Carlos', 'España')]

# 2. Hacer consultas anidadas en una misma tabla.

Bien a continuación encontraremos una tabla de ejercicios.

In [9]:
%%sql
CREATE TABLE exercise_logs
    (id INTEGER PRIMARY KEY AUTOINCREMENT,
    type TEXT,
    minutes INTEGER, 
    calories INTEGER,
    heart_rate INTEGER,
    intensity);

INSERT INTO exercise_logs(type, minutes, calories, heart_rate, intensity) VALUES 
    ('biking', 30, 100, 110, 'high'), 
    ('walk', 60, 30, 100, 'low'), 
    ('dancing', 15, 200, 120, 'medium'),
    ('run', 30, 250, 140, 'high'), 
    ('swim', 60, 300, 120,'medium'), 
    ('aerobics', 15, 200, 150, 'medium'),
    ('yoga', 30, 100, 110, 'high'), 
    ('weight lifting', 60, 30, 100, 'low'), 
    ('boxing', 15, 200, 120, 'medium'),
    ('pilates', 30, 250, 140, 'medium');

 * sqlite://
Done.
10 rows affected.

[]

### Consulta anidada.

En la siguiente tabla sacaremos los promedios de la frecuencia cardiaca y las calorias y luego compararemos para comprobar que la frecuencia cardiaca sea inferior al promedio y las calorias consumidas superior al promedio.

In [10]:
%%sql
SELECT type, calories, heart_rate FROM exercise_logs 
WHERE heart_rate < (SELECT AVG(heart_rate) FROM exercise_logs) AND calories > (SELECT AVG(calories) FROM exercise_logs);

 * sqlite://
Done.

[('dancing', 200, 120), ('swim', 300, 120), ('boxing', 200, 120)]

## Explicación. 

Esta consulta selecciona el tipo de ejercicio, las calorías quemadas y la frecuencia cardiaca de la tabla "exercise_logs" para aquellos registros que cumplan con las siguientes condiciones:

    -La frecuencia cardiaca es menor que la frecuencia cardiaca promedio de todos los registros de la tabla "exercise_logs".
    -Las calorías quemadas son mayores que el número promedio de calorías quemadas de todos los registros de la tabla "exercise_logs".
    
Para calcular la frecuencia cardiaca promedio y el número promedio de calorías quemadas, utilizamos las consultas anidadas **SELECT AVG(heart_rate) FROM exercise_logs y SELECT AVG(calories) FROM exercise_logs**, respectivamente. Estas consultas anidadas nos devuelven el valor promedio de la columna especificada y luego lo comparamos con los valores de cada registro utilizando la cláusula WHERE.

Por ejemplo, si la tabla "exercise_logs" tiene los siguientes registros:
    
<table>
  <thead>
    <tr>
      <th>type</th>
      <th>calories</th>
      <th>heart_rate</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>biking</td>
      <td>100</td>
      <td>110</td>
    </tr>
    <tr>
      <td>walking</td>
      <td>50</td>
      <td>80</td>
    </tr>
    <tr>
      <td>running</td>
      <td>150</td>
      <td>120</td>
    </tr>
    <tr>
      <td>swimming</td>
      <td>200</td>
      <td>90</td>
    </tr>
  </tbody>
</table>


    
La frecuencia cardiaca promedio sería de 100 y el número promedio de calorías quemadas sería de 125. Por lo tanto, la consulta seleccionaría los siguientes registros:

calorías quemadas sería de 125. Por lo tanto, la consulta seleccionaría los siguientes registros:

<table>
  <thead>
    <tr>
      <th>id</th>
      <th>id_cliente</th>
      <th>monto</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>1</td>
      <td>1</td>
      <td>100</td>
    </tr>
    <tr>
      <td>2</td>
      <td>2</td>
      <td>50</td>
    </tr>
    <tr>
      <td>3</td>
      <td>3</td>
      <td>75</td>
    </tr>
    <tr>
      <td>4</td>
      <td>4</td>
      <td>200</td>
    </tr>
    <tr>
      <td>5</td>
      <td>1</td>
      <td>25</td>
    </tr>
    <tr>
      <td>6</td>
      <td>5</td>
      <td>125</td>
    </tr>
  </tbody>
</table>

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">

In [ ]:
Ejercicios

Ejercicio:

Utilizando la tabla "exercise_logs", selecciona el tipo de ejercicio y las calorías quemadas para aquellos registros que cumplan con las siguientes condiciones:

Las calorías quemadas son mayores que el número promedio de calorías quemadas de todos los registros de la tabla "exercise_logs".
Los minutos consumidos son menores que el número promedio de minutos consumidos de todos los registros de la tabla "exercise_logs".
Para resolver este ejercicio, debes utilizar las consultas anidadas SELECT AVG(calories) FROM exercise_logs y SELECT AVG(minutes) FROM exercise_logs para calcular los promedios de calorías quemadas y minutos consumidos, respectivamente. Luego, debes utilizar la cláusula WHERE y los operadores lógicos > y < para comparar los valores de cada registro con los promedios obtenidos.

Para seleccionar solo los tres registros con menor tiempo consumido y mayor cantidad de calorías quemadas, debes utilizar la cláusula ORDER BY minutes ASC después de la cláusula WHERE, y luego utilizar la cláusula LIMIT 3 al final de la consulta para seleccionar solo los primeros tres registros.

Por ejemplo, si la tabla "exercise_logs" tiene los siguientes registros:

<table>
  <tr>
    <th>type</th>
    <th>minutes</th>
    <th>calories</th>
  </tr>
  <tr>
    <td>biking</td>
    <td>30</td>
    <td>100</td>
  </tr>
  <tr>
    <td>walking</td>
    <td>60</td>
    <td>50</td>
  </tr>
  <tr>
    <td>running</td>
    <td>15</td>
    <td>150</td>
  </tr>
  <tr>
    <td>swimming</td>
    <td>20</td>
    <td>200</td>
  </tr>
</table>

El número promedio de calorías quemadas sería de 125 y el número promedio de minutos consumidos sería de 35. Por lo tanto, la consulta debería seleccionar los siguientes registros:

<table>
  <tr>
    <th>type</th>
    <th>calories</th>
  </tr>
  <tr>
    <td>biking</td>
    <td>100</td>
  </tr>
  <tr>
    <td>running</td>
    <td>150</td>
  </tr>
</table>

In [11]:
%%sql
SELECT type, calories FROM exercise_logs
WHERE calories > (SELECT AVG(calories) FROM exercise_logs)
AND minutes < (SELECT AVG(minutes) FROM exercise_logs)
ORDER BY minutes ASC
LIMIT 3;

 * sqlite://
Done.

[('dancing', 200), ('aerobics', 200), ('boxing', 200)]

<hr style="height:5px; width: 100%; border-radius: 20%; background-color:#E7046B ; border-color: #E7046B">